In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:1234@localhost/test

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('dement',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('test',),
 ('uber',)]

In [4]:
%%sql
use uber;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [9]:
%%sql
drop table rides;
CREATE TABLE rides (
    ride_id INT ,
    driver_id INT NOT NULL,
    rider_id INT ,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL,
    primary key(ride_id , rider_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [12]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [16]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 202, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1-202' for key 'rides.PRIMARY'
[SQL: INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 202, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [15]:
%%sql 
select * from uber.rides;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (1, 101, 202, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

In [17]:
%%sql
CREATE TABLE users (
    user_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [19]:
%%sql
INSERT INTO users (user_id, email)
VALUES (1, 'user1@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [20]:
%%sql
INSERT INTO users (user_id, email)
VALUES (2, 'user2@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [21]:
%%sql
INSERT INTO users (user_id, email)
VALUES (3, NULL); 
#null is allowed in a unique but not dup value

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [22]:
%%sql
INSERT INTO users (user_id, email)
VALUES (4, 'user1@example.com');
#as no duplicate allowed

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry 'user1@example.com' for key 'users.email'
[SQL: INSERT INTO users (user_id, email)
VALUES (4, 'user1@example.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [26]:
%%sql
drop table rides;
 CREATE TABLE rides (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT  NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [27]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [29]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(3, 103, null, null, 'Chennai', '2024-12-29 14:00:00', 600.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1048 (23000): Column 'pickup_location' cannot be null
[SQL: INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(3, 103, null, null, 'Chennai', '2024-12-29 14:00:00', 600.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
%%sql
#check constrain -- eg in table defn : check (fare>0) while inserting if its negative it fails

In [16]:
%%sql
drop table if exists drivers;
CREATE TABLE drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);
 
-- Creating the rides table with driver_id as a foreign key
drop table if exists rides;
CREATE TABLE rides (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id)
);

# to delete driver first we have to delete rides , since drivers table connected to rides

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [9]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', 'MUL', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [17]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES (101, 'John Doe', 'XYZ12345'), (102, 'Jane Smith', 'ABC67890');

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [18]:
%%sql
INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [24]:
%%sql
select * from drivers;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(102, 'Jane Smith', 'ABC67890')]

In [22]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'))]

In [23]:
%%sql
delete from drivers where driver_id=101;
#because it is connected to ride table -- one to many , but u can delete from ride table -- shown below

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.
0 rows affected.

[]

In [21]:
%%sql
delete from rides where driver_id=101;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [14]:
%%sql
drop table rides;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [15]:
%%sql 
drop table drivers;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [25]:
%%sql
CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    country VARCHAR(50) DEFAULT 'India'
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [26]:
%%sql
INSERT INTO customers (customer_id, customer_name)
VALUES (2, 'Jane Smith');
#sets to default

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [28]:
%%sql
INSERT INTO customers (customer_id, customer_name, country)
VALUES (3,'Naren','UAE');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [29]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(2, 'Jane Smith', 'India'), (3, 'Naren', 'UAE')]

In [ ]:
Failure Case (Foreign Key Violation on Insert):

If you try to insert a ride with a non-existing `driver_id` that doesn’t exist in the `drivers` table, it will fail due to the foreign key constraint:


-- Attempting to insert a ride with a non-existing driver_id
INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES (304, 999, 'Coimbatore', 'Chennai', '2024-12-03 10:00:00', 800.00);


Error: This will fail because `driver_id = 999` does not exist in the `drivers` table, and the foreign key constraint ensures that only valid driver IDs can be referenced.

---

Scenario 2: Deleting Driver and Its Associated Rides

Now, let's explore the deletion behavior when we delete a driver. If you delete a driver, you might want to know how it impacts the associated rides.

Deletion of Driver (Without Cascade)

When you delete a driver (say `driver_id = 101`) from the `drivers` table, if there are associated rides in the `rides` table, the deletion will fail because of the foreign key constraint (without `ON DELETE CASCADE`).


-- Trying to delete a driver with existing rides in the rides table
DELETE FROM drivers WHERE driver_id = 101;


Error: The deletion will fail with an error like this:

ERROR:  update or delete on table "drivers" violates foreign key constraint "rides_driver_id_fkey" on table "rides"


This happens because the foreign key constraint prevents the deletion of a driver who has existing rides. The system does this to maintain referential integrity — there should be no orphaned rides without a valid driver.

What Happens with `ON DELETE CASCADE`?

If you want to automatically delete all rides associated with a driver when the driver is deleted, you can use the `ON DELETE CASCADE` option in the foreign key definition.

In [ ]:
-- Creating the rides table with ON DELETE CASCADE
CREATE TABLE rides (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id) ON DELETE CASCADE
);


Now, if you delete a driver, all associated rides will be automatically deleted as well.


-- Deleting driver 101 will also delete all rides associated with driver 101
DELETE FROM drivers WHERE driver_id = 101;


This will delete the driver and all the associated rides (`ride_id = 301, 302`), ensuring that there are no orphaned records in the `rides` table.